-- 添加废品种类
INSERT INTO garbage_type (name) VALUES
('废纸'), ('废塑料'), ('手机'), ('电池'), ('报废车辆'), ('废金属'), ('厨房五金');

-- 添加具体废品（废纸为例）
INSERT INTO garbage(type_name, name, price) VALUES
('废纸', '纸板箱', 0.5),
('废纸', '瓦楞纸', 0.4),
('废纸', '牛皮纸', 0.7),
('废纸', '铜版纸', 0.5),
('废纸', '废报纸', 0.8),
('废纸', '书刊纸', 0.6),
('废纸',	'废卡纸',	 0.5),
('废纸',	'废纸边', 0.2),
('废纸', '办公废纸', 0.4),
('废纸', '混合废纸', 0.2),

('废塑料', '塑料瓶',	1.6),
('废塑料', '塑料容器',	0.5),
('废塑料', '塑料薄膜',	0.5),
('废塑料', '塑料玩具', 0.5),
('废塑料', '一次性塑料饭盒', 0.4),
('废塑料', '泡沫塑料', 0.3),

('手机',	'智能手机', 1),
('手机',	'普通手机', 1),
('手机',	'小灵通	', 1),
('手机',	'对讲机	', 1),
('手机',	'大哥大	', 1),

('电池',	'蓄电池'	, 9),
('电池',	'镉镍电池', 0.5),
('电池',	'锂电池', 0.8),
('电池',	'干电池', 0.8),

('报废车辆',	'报废摩托车',	80),
('报废车辆',	'报废电动车',	40),
('报废车辆',	'报废自行车',	0.3),
('报废车辆',	'报废平衡车',	0.5),

('废金属', '红铜', 7),
('废金属', '黄铜', 10),
('废金属', '紫铜', 10),
('废金属', '铝', 3),
('废金属', '不锈钢',	1),
('废金属', '铝合金',	2),
('废金属', '锌合金',	3),
('废金属', '废旧钢铁',	0.3),

('厨房五金', '电热水器', 0.2),
('厨房五金', '燃气灶', 0.5),
('厨房五金', '水壶', 0.4),
('厨房五金', '燃气热水器', 0.8),
('厨房五金', '抽油烟机', 0.8),
('厨房五金', '消毒柜', 0.4),
('厨房五金', '电饭煲', 0.3),
('厨房五金', '微波炉', 0.5),
('厨房五金', '烤箱', 0.8),
('厨房五金', '破壁机',	 0.5);

